# SphericalLightDistribution Constructor (SphericalLightDistribution)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SphericalLightDistribution Constructor (SphericalLightDistribution)
SphericalLightDistribution Class See Also
---
Creates a copy of the given spherical light distribution
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public SphericalLightDistribution(
	SphericalLightDistribution other
)
```

Visual Basic
---
```text
Public Sub New ( _
	other As SphericalLightDistribution _
)
```

Visual C++
---
```text
public:
SphericalLightDistribution(
	SphericalLightDistribution^ other
)
```

# ### Parameters
other
    Type: Autodesk.Revit.DB.Lighting..::..SphericalLightDistribution
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SphericalLightDistribution Class
SphericalLightDistribution Overload
Autodesk.Revit.DB.Lighting Namespace